In [80]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("FoodBalanceSheets_E_Africa_NOFLAG.csv", encoding = "latin-1")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60943 entries, 0 to 60942
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Area Code     60943 non-null  int64
 1   Area          60943 non-null  object
 2   Item Code     60943 non-null  int64
 3   Item          60943 non-null  object
 4   Element Code  60943 non-null  int64
 5   Element       60943 non-null  object
 6   Unit          60943 non-null  object
 7   Y2014         59354 non-null  float64
 8   Y2015         59395 non-null  float64
 9   Y2016         59408 non-null  float64
 10  Y2017         59437 non-null  float64
 11  Y2018         59507 non-null  float64
dtypes: float64(5), int64(3), object(4)
memory usage: 5.6+ MB

In [3]:
df.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

#### Question 1
#### What is the mean and standard deviation across the whole dataset for the year 2017 to 2 decimal places?

In [16]:
df['Y2017'].mean()

140.9177648602722

In [17]:
df['Y2017'].std()

1671.8623590572788

#### Question 2
#### If you have the following list
#### lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]
#### col = [‘Age’,’Nationality’,’Overall’]
#### How do you create a pandas DataFrame using this list, to look like the table below?

In [72]:
lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

col = ['Age','Nationality','Overall']

pd.DataFrame(lst, columns=col, index=[1,2,3])

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

#### Question 3
#### What would be the output for?
#### S = [['him', 'sell'], [90, 28, 43]]
#### S[0][1][1]

In [19]:
S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

'e'

#### Question 5
#### What is the total sum of Wine produced in 2015 and 2018 respectively?

In [74]:
df.groupby('Item')['Y2015'].sum()['Wine']

4251.81

In [75]:
df.groupby('Item')['Y2018'].sum()['Wine']

4039.32

#### Question 7

#### Consider the following list of tuples:
#### y = [(2, 4), (7, 8), (1, 5, 9)]
#### How would you assign element 8 from the list to a variable x?

In [28]:
y = [(2, 4), (7, 8), (1, 5, 9)]

x = y[1][1]
x

8

#### Question 8

#### Given the following numpy array below

#### How would you select  the elements in bold and italics from the array?

In [83]:
array = np.array([[94, 89, 63],
                  [93, 92, 48],
                  [92, 94, 56]])

array[:2, 1:]

array([[89, 63],
       [92, 48]])

#### Question 9
#### What is the total number and percentage of missing data in 2014 to 3 decimal places?

In [88]:
total_sum = sum(df['Y2014'].isnull())
percentage = (total_sum / 60943) * 100

print(f'Total number of missing data in 2014 is {total_sum}')
print(f'Percentage of missing data in 2014 is {percentage:.3f}%')

Total number of missing data in 2014 is 1589
Percentage of missing data in 2014 is 2.607%

#### Question 11

#### Which year had the least correlation with ‘Element Code’?

#### Question 12

#### How would you check for the number of rows and columns in a pandas DataFrame named df?

In [32]:
df.shape

(60943, 12)

#### Question 13

#### Perform a groupby operation on ‘Element’.  What is the total number of the sum of Processing in 2017?

In [35]:
df.groupby('Element')['Y2017'].sum()['Processing']

292836.0

#### Question 14

#### What is the total Protein supply quantity in Madagascar in 2015?

In [37]:
df[(df['Area'] == 'Madagascar') & (df['Item'] == 'Protein')]

Empty DataFrame
Columns: [Area Code, Area, Item Code, Item, Element Code, Element, Unit, Y2014, Y2015, Y2016, Y2017, Y2018]
Index: []

#### Question 15

#### Perform a groupby operation on ‘Element’.  What year has the highest sum of Stock Variation?)

In [96]:
df.groupby('Element').max().loc['Stock Variation']

Area Code               276
Area               Zimbabwe
Item Code              2961
Item                   Yams
Element Code           5072
Unit            1000 tonnes
Y2014                4569.0
Y2015                3418.0
Y2016                3266.0
Y2017                5089.0
Y2018                2226.0
Name: Stock Variation, dtype: object

#### Question 16

#### Given the following python code, what would the output of the code give?

In [47]:
my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

TypeError: 'tuple' object does not support item assignment

#### Question 17

#### Select columns ‘Y2017’ and ‘Area’, Perform a groupby operation on ‘Area’.  Which of these Areas had the highest sum in 2017?

In [104]:
Area_Y2017 = df[['Y2017', 'Area']].groupby('Area').sum()

highest_area = Area_Y2017.sort_values(by='Y2017', ascending=False).index[0]

print(f"Area with the highest sum in 2017 is {highest_area}")

Area with the highest sum in 2017 is Nigeria

#### Question 18

#### What is the total number of unique countries in the dataset?

In [99]:
df['Area'].nunique()

49

#### Question 19
#### Select columns ‘Y2017’ and ‘Area’, Perform a groupby operation on ‘Area’. Which of these Areas had the 7th lowest sum in 2017?

In [106]:
Area_Y2017 = df[['Y2017', 'Area']].groupby('Area').sum()

seventh_lowest_area = Area_Y2017.sort_values(by='Y2017', ascending=False).index[-7]

print(f"Area with the 7th lowest sum in 2017 {seventh_lowest_area}")

Area with the 7th lowest sum in 2017 Guinea-Bissau